# MEPBuildingConstructionSet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPBuildingConstructionSet Constructor
MEPBuildingConstructionSet Class See Also
---
Initializes a new instance of the MEPBuildingConstructionSet class
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MEPBuildingConstructionSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
MEPBuildingConstructionSet()
```

# See Also
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace